Res-firecracker-set-v8/firecracker_t_10_c_30_frontVcpu_6_wrkVcpu_1/wrk.txt
Running 1m test @ http://frontend:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 4041.355ms, rate sampling interval: 16400ms
  Thread calibration: mean lat.: 4895.409ms, rate sampling interval: 16416ms
  Thread calibration: mean lat.: 4885.163ms, rate sampling interval: 17301ms
  Thread calibration: mean lat.: 4922.669ms, rate sampling interval: 17514ms
  Thread calibration: mean lat.: 4942.975ms, rate sampling interval: 17465ms
  Thread calibration: mean lat.: 5014.835ms, rate sampling interval: 17530ms
  Thread calibration: mean lat.: 4166.715ms, rate sampling interval: 16572ms
  Thread calibration: mean lat.: 4906.740ms, rate sampling interval: 17530ms
  Thread calibration: mean lat.: 4985.672ms, rate sampling interval: 17498ms
  Thread calibration: mean lat.: 5005.778ms, rate sampling interval: 17530ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    25.97s    14.95s    0.95m    66.19%
    Req/Sec   423.96      4.46   432.00     82.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.36s 
 75.000%   37.75s 
 90.000%   49.38s 
 99.000%    0.95m 
 99.900%    0.97m 
 99.990%    0.97m 
 99.999%    0.97m 
100.000%    0.97m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.378     0.000000            1         1.00
    9879.551     0.100000        21223         1.11
   13049.855     0.200000        42481         1.25
   15917.055     0.300000        63673         1.43
   19628.031     0.400000        84944         1.67
   22364.159     0.500000       106110         2.00
   24018.943     0.550000       116724         2.22
   26279.935     0.600000       127327         2.50
   29949.951     0.650000       137905         2.86
   33947.647     0.700000       148560         3.33
   37748.735     0.750000       159123         4.00
   39485.439     0.775000       164427         4.44
   41582.591     0.800000       169766         5.00
   43548.671     0.825000       175066         5.71
   45350.911     0.850000       180361         6.67
   47251.455     0.875000       185632         8.00
   48332.799     0.887500       188290         8.89
   49381.375     0.900000       190926        10.00
   50397.183     0.912500       193565        11.43
   51478.527     0.925000       196239        13.33
   52527.103     0.937500       198894        16.00
   53051.391     0.943750       200277        17.78
   53575.679     0.950000       201575        20.00
   54067.199     0.956250       202911        22.86
   54558.719     0.962500       204209        26.67
   55083.007     0.968750       205498        32.00
   55345.151     0.971875       206200        35.56
   55607.295     0.975000       206865        40.00
   55869.439     0.978125       207501        45.71
   56131.583     0.981250       208177        53.33
   56426.495     0.984375       208870        64.00
   56557.567     0.985938       209173        71.11
   56688.639     0.987500       209494        80.00
   56852.479     0.989062       209854        91.43
   57016.319     0.990625       210173       106.67
   57180.159     0.992188       210497       128.00
   57245.695     0.992969       210636       142.22
   57343.999     0.993750       210857       160.00
   57409.535     0.994531       210982       182.86
   57507.839     0.995313       211161       213.33
   57573.375     0.996094       211292       256.00
   57638.911     0.996484       211428       284.44
   57671.679     0.996875       211489       320.00
   57704.447     0.997266       211549       365.71
   57769.983     0.997656       211665       426.67
   57802.751     0.998047       211741       512.00
   57835.519     0.998242       211805       568.89
   57835.519     0.998437       211805       640.00
   57868.287     0.998633       211843       731.43
   57901.055     0.998828       211886       853.33
   57933.823     0.999023       211921      1024.00
   57966.591     0.999121       211949      1137.78
   57999.359     0.999219       211972      1280.00
   58032.127     0.999316       211998      1462.86
   58032.127     0.999414       211998      1706.67
   58097.663     0.999512       212039      2048.00
   58097.663     0.999561       212039      2275.56
   58097.663     0.999609       212039      2560.00
   58130.431     0.999658       212056      2925.71
   58163.199     0.999707       212071      3413.33
   58163.199     0.999756       212071      4096.00
   58195.967     0.999780       212083      4551.11
   58195.967     0.999805       212083      5120.00
   58195.967     0.999829       212083      5851.43
   58228.735     0.999854       212095      6826.67
   58228.735     0.999878       212095      8192.00
   58261.503     0.999890       212104      9102.22
   58261.503     0.999902       212104     10240.00
   58261.503     0.999915       212104     11702.86
   58261.503     0.999927       212104     13653.33
   58327.039     0.999939       212111     16384.00
   58327.039     0.999945       212111     18204.44
   58327.039     0.999951       212111     20480.00
   58327.039     0.999957       212111     23405.71
   58359.807     0.999963       212115     27306.67
   58359.807     0.999969       212115     32768.00
   58359.807     0.999973       212115     36408.89
   58359.807     0.999976       212115     40960.00
   58359.807     0.999979       212115     46811.43
   58392.575     0.999982       212118     54613.33
   58392.575     0.999985       212118     65536.00
   58392.575     0.999986       212118     72817.78
   58392.575     0.999988       212118     81920.00
   58392.575     0.999989       212118     93622.86
   58392.575     0.999991       212118    109226.67
   58392.575     0.999992       212118    131072.00
   58392.575     0.999993       212118    145635.56
   58392.575     0.999994       212118    163840.00
   58392.575     0.999995       212118    187245.71
   58425.343     0.999995       212119    218453.33
   58425.343     1.000000       212119          inf
#[Mean    =    25971.447, StdDeviation   =    14948.126]
#[Max     =    58392.576, Total count    =       212119]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  253671 requests in 1.00m, 105.00MB read
Requests/sec:   4228.03
Transfer/sec:      1.75MB